# ElevationDetach Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElevationFailures..::..ElevationDetach Property
BuiltInFailures..::..ElevationFailures Class See Also
---
An Elevation arrow can't keep its Crop Region extents attached.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElevationDetach { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevationDetach As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElevationDetach {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElevationFailures Class
Autodesk.Revit.DB Namespace